In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
train = pd.read_excel('Train.xlsx')
train.head()

,TYPE,HUNDRED_BLOCK,NEIGHBOURHOOD,X,Y,Latitude,Longitude,HOUR,MINUTE,YEAR,MONTH,DAY,Date
0,Other Theft,9XX TERMINAL AVE,Strathcona,493906.5,5457452.47,49.269802,-123.083763,16.0,15.0,1999,5,12,1999-05-12
1,Other Theft,9XX TERMINAL AVE,Strathcona,493906.5,5457452.47,49.269802,-123.083763,15.0,20.0,1999,5,7,1999-05-07
2,Other Theft,9XX TERMINAL AVE,Strathcona,493906.5,5457452.47,49.269802,-123.083763,16.0,40.0,1999,4,23,1999-04-23
3,Other Theft,9XX TERMINAL AVE,Strathcona,493906.5,5457452.47,49.269802,-123.083763,11.0,15.0,1999,4,20,1999-04-20
4,Other Theft,9XX TERMINAL AVE,Strathcona,493906.5,5457452.47,49.269802,-123.083763,17.0,45.0,1999,4,12,1999-04-12

In [3]:
train.shape

(474565, 13)

In [4]:
train.isnull().sum()

TYPE                 0
HUNDRED_BLOCK       13
NEIGHBOURHOOD    51491
X                    0
Y                    0
Latitude             0
Longitude            0
HOUR             49365
MINUTE           49365
YEAR                 0
MONTH                0
DAY                  0
Date                 0
dtype: int64

In [8]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 474565 entries, 0 to 474564
Data columns (total 13 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   TYPE           474565 non-null  object
 1   HUNDRED_BLOCK  474552 non-null  object
 2   NEIGHBOURHOOD  423074 non-null  object
 3   X              474565 non-null  float64
 4   Y              474565 non-null  float64
 5   Latitude       474565 non-null  float64
 6   Longitude      474565 non-null  float64
 7   HOUR           425200 non-null  float64
 8   MINUTE         425200 non-null  float64
 9   YEAR           474565 non-null  int64
 10  MONTH          474565 non-null  int64
 11  DAY            474565 non-null  int64
 12  Date           474565 non-null  datetime64[ns]
dtypes: datetime64[ns](1), float64(6), int64(3), object(3)
memory usage: 47.1+ MB

In [9]:
train['Date'].max(), train['Date'].min()

(Timestamp('2011-12-31 00:00:00'), Timestamp('1999-01-01 00:00:00'))

In [5]:
test = pd.read_csv('Test.csv')
test.head()

,YEAR,MONTH,TYPE,Incident_Counts
0,2013,6,Vehicle Collision or Pedestrian Struck (with I...,NaN
1,2013,6,Theft of Vehicle,NaN
2,2013,6,Theft of Bicycle,NaN
3,2013,6,Theft from Vehicle,NaN
4,2013,6,Other Theft,NaN

In [6]:
test.shape

(162, 4)

In [7]:
test.isnull().sum()

YEAR                 0
MONTH                0
TYPE                 0
Incident_Counts    162
dtype: int64

In [10]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 162 entries, 0 to 161
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   YEAR             162 non-null    int64
 1   MONTH            162 non-null    int64
 2   TYPE             162 non-null    object
 3   Incident_Counts  0 non-null      float64
dtypes: float64(1), int64(2), object(1)
memory usage: 5.2+ KB

In [11]:
test['YEAR'].max(), test['YEAR'].min(), test['MONTH'].max(), test['MONTH'].min()

(2013, 2012, 12, 1)

In [16]:
newtrain = train[['Date', 'TYPE']]
newtrain

             Date                TYPE
0      1999-05-12         Other Theft
1      1999-05-07         Other Theft
2      1999-04-23         Other Theft
3      1999-04-20         Other Theft
4      1999-04-12         Other Theft
...           ...                 ...
474560 2011-10-29  Theft from Vehicle
474561 2011-03-09  Theft from Vehicle
474562 2011-02-10         Other Theft
474563 2011-12-20         Other Theft
474564 2011-02-03            Mischief

[474565 rows x 2 columns]

In [17]:
newtrain['Month_Year'] = newtrain['Date'].dt.strftime('%Y-%m')

C:\Users\ahpat\AppData\Local\Temp\ipykernel_29144\1133099336.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newtrain['Month_Year'] = newtrain['Date'].dt.strftime('%Y-%m')

In [19]:
newtrain = newtrain.drop('Date', axis = 1)
newtrain

                      TYPE Month_Year
0              Other Theft    1999-05
1              Other Theft    1999-05
2              Other Theft    1999-04
3              Other Theft    1999-04
4              Other Theft    1999-04
...                    ...        ...
474560  Theft from Vehicle    2011-10
474561  Theft from Vehicle    2011-03
474562         Other Theft    2011-02
474563         Other Theft    2011-12
474564            Mischief    2011-02

[474565 rows x 2 columns]

In [27]:
newtest = test.copy()
newtest.head()

,YEAR,MONTH,TYPE,Incident_Counts
0,2013,6,Vehicle Collision or Pedestrian Struck (with I...,NaN
1,2013,6,Theft of Vehicle,NaN
2,2013,6,Theft of Bicycle,NaN
3,2013,6,Theft from Vehicle,NaN
4,2013,6,Other Theft,NaN

In [28]:
newtest = newtest.drop('Incident_Counts', axis = 1)
newtest

     YEAR  MONTH                                               TYPE
0    2013      6  Vehicle Collision or Pedestrian Struck (with I...
1    2013      6                                   Theft of Vehicle
2    2013      6                                   Theft of Bicycle
3    2013      6                                 Theft from Vehicle
4    2013      6                                        Other Theft
..    ...    ...                                                ...
157  2012      1                                        Other Theft
158  2012      1                           Offence Against a Person
159  2012      1                                           Mischief
160  2012      1                  Break and Enter Residential/Other
161  2012      1                         Break and Enter Commercial

[162 rows x 3 columns]

In [29]:
newtest.groupby(['YEAR', 'MONTH']).count()['TYPE']

YEAR  MONTH
2012  1        9
      2        9
      3        9
      4        9
      5        9
      6        9
      7        9
      8        9
      9        9
      10       9
      11       9
      12       9
2013  1        9
      2        9
      3        9
      4        9
      5        9
      6        9
Name: TYPE, dtype: int64

In [34]:
test['Incident_Counts'] = test['Incident_Counts'].fillna(9)

In [35]:
solution = pd.DataFrame(test['Incident_Counts'])
solution.head()

   Incident_Counts
0              9.0
1              9.0
2              9.0
3              9.0
4              9.0

In [37]:
solution.shape

(162, 1)

In [38]:
solution.to_csv('Solution.csv', index = False)